// Да се напише функция, която получава час и минути от 24-часово денонощие и изчислява колко ще е часът след 15 минути. 
//Резултатът да се отпечата във формат часове:минути. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. 
//Часовете се изписват с една или две цифри. Минутите се изписват винаги с по две цифри, с водеща нула, когато е необходимо. 

function time_plus(hours, minutes)
{
    minutes += 15; // vinagi dobavqme 15 min

    if(minutes >=60)
    {
        minutes -= 60;
        hours += 1;
    }

    if(hours >=24)
        {
            hours = 0;
        }

    if(minutes < 10)
        console.log(`${hours}:0${minutes}`);
    else
        console.log(`${hours}:${minutes}`);
}

time_plus(1, 46);
time_plus(23, 59);